ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f28p55x_nmi_intrupt_regs.xml
<module id="NMI_INTRUPT_REGS" HW_revision="" description="NMI INTRUPT Registers">
	<register id="NMICFG" width="16" page="1" offset="0x0" internal="0" description="NMI Configuration Register">
		<bitfield id="NMIE" description="Global NMI Enable" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="NMIFLG" width="16" page="1" offset="0x1" internal="0" description="NMI Flag Register (SYSRsn Clear)">
		<bitfield id="NMIINT" description="NMI Interrupt Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CLOCKFAIL" description="Clock Fail Interrupt Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="UNCERR" description="Flash/RAM/ROM Uncorrectable Error NMI Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="SYSDBGNMI" description="System Debug Module NMI Flag" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="RLNMI" description="Reconfigurable Logic NMI Flag" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="SWERR" description="SW Error Force NMI Flag" begin="13" end="13" width="1" rwaccess="R"/>
	</register>
	<register id="NMIFLGCLR" width="16" page="1" offset="0x2" internal="0" description="NMI Flag Clear Register">
		<bitfield id="NMIINT" description="NMIINT Flag Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLOCKFAIL" description="CLOCKFAIL Flag Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description="Flash/RAM/ROM Uncorrectable Error NMI Flag clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SYSDBGNMI" description="SYSDBGNMI Flag Clear" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="RLNMI" description="RLNMI Flag Clear" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SWERR" description="SW Error Flag Clear" begin="13" end="13" width="1" rwaccess="RW"/>
	</register>
	<register id="NMIFLGFRC" width="16" page="1" offset="0x3" internal="0" description="NMI Flag Force Register">
		<bitfield id="CLOCKFAIL" description="CLOCKFAIL Flag Force" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description="Flash/RAM/ROM Uncorrectable Error NMI Flag force" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SYSDBGNMI" description="SYSDBGNMI Flag Force" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="RLNMI" description="RLNMI Flag Force" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SWERR" description="SW Error Flag Force" begin="13" end="13" width="1" rwaccess="RW"/>
	</register>
	<register id="NMIWDCNT" width="16" page="1" offset="0x4" internal="0" description="NMI Watchdog Counter Register">
		<bitfield id="NMIWDCNT" description="NMI Watchdog Counter" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="NMIWDPRD" width="16" page="1" offset="0x5" internal="0" description="NMI Watchdog Period Register">
		<bitfield id="NMIWDPRD" description="NMI Watchdog Period" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="NMISHDFLG" width="16" page="1" offset="0x6" internal="0" description="NMI Shadow Flag Register">
		<bitfield id="CLOCKFAIL" description="Shadow CLOCKFAIL Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="UNCERR" description="Flash/RAM/ROM Uncorrectable Error NMI shadow flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="SYSDBGNMI" description="Shadow SYSDBGNMI Flag" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="RLNMI" description="Shadow RLNMI Flag" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="SWERR" description="Shadow SW Error Flag" begin="13" end="13" width="1" rwaccess="R"/>
	</register>
	<register id="ERRORSTS" width="16" page="1" offset="0x7" internal="0" description="Error pin status">
		<bitfield id="ERROR" description="Error flag." begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="PINSTS" description="Error pin status." begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="ERRORSTSCLR" width="16" page="1" offset="0x8" internal="0" description="ERRORSTS clear register">
		<bitfield id="ERROR" description="ERRORFLG.ERROR clear bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="ERRORSTSFRC" width="16" page="1" offset="0x9" internal="0" description="ERRORSTS force register">
		<bitfield id="ERROR" description="ERRORSTS.ERROR pin force." begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="ERRORCTL" width="16" page="1" offset="0xa" internal="0" description="Error pin control register">
		<bitfield id="ERRORPOLSEL" description="ERROR pin polarity select" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="ERRORLOCK" width="16" page="1" offset="0xb" internal="0" description="Lock register to Error pin registers.">
		<bitfield id="ERRORCTL" description="ERRORCTL Lock bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
